function [hessian] = HessianPowell(x)
%HessianRosen 给定包含两个元素的一位向量x，返回Rosenbrock在x点的海森矩阵hessian
%   此处显示详细说明

% hessian = [1200*x(1).^2 - 400*x(2) + 2, -400*x(1); 
%             -400*x(1), 200];
hessian = [2 + 120 * ( x(1) - x(4) ).^2, 20, 0, -120 * ( x(1) - x(4) ) .^2;
           20, 200 + 12 * ( x(2) - 2 * x(3) ).^2, -24 * ( x(2) - 2 * x(3) ).^2, 0;
           0, -24 * ( x(2) - 2 * x(3)).^2, 10 + 48 * ( x(2) - 2 * x(3) ).^2, -10;
           -120 * ( x(1) - x(4) ).^2, 0, -10, 10 + 120 * ( x(1) - x(4) ).^2];       

end

